app/views/employees/index.html.erb

SELECT "stores".* FROM "stores"
---
    <div class="dropdown-content">
      <% Store.all.each do |s| %>

SELECT  "users".* FROM "users" WHERE "users"."employee_id" = ? LIMIT ?  [["employee_id", 20], ["LIMIT", 1]]
---
        <td><%= employee.active %></td>
        <td><% if employee.user.present? %>