app/views/employees/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."employee_id" = ? LIMIT ?  [["employee_id", 13], ["LIMIT", 1]]
---
        <td><%= employee.active %></td>
        <td><% if employee.user.present? %>