app/views/employees/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."employee_id" = ? LIMIT ?  [["employee_id", 17], ["LIMIT", 1]]
---
  <strong>Email:</strong>
  <% if @employee.user.present? %>