app/views/assignments/_form.html.erb

    <!--<%= form.text_field :store_id, id: :assignment_store_id, :style => "position:relative;" %>-->
    <% @stores=Store.all %>
---
SELECT "stores".* FROM "stores"

    <!--<%= form.text_field :employee_id, id: :assignment_employee_id, :style => "position:relative; " %>-->
    <% @employees=Employee.all %>
---
SELECT "employees".* FROM "employees"