app/views/assignments/index.html.erb

    <div class="dropdown-content">
      <% Store.all.each do |s| %>
---
SELECT "stores".* FROM "stores"

      <% if @role == "admin" %>
      <% Employee.all.each do |s| %>
---
SELECT "employees".* FROM "employees"

      <% if @role == "manager" %>
      <% Employee.regulars.for_store(current_user.employee.current_assignment.store_id).uniq.each do |s| %>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" ORDER BY start_date DESC, end_date DESC