app/views/storeflavors/_form.html.erb

SELECT "flavors".* FROM "flavors"
SELECT "stores".* FROM "stores"
---
<%
  @flavors=Flavor.all
  @role = current_user_role
  @stores = Store.all