app/views/shifts/_form.html.erb

    if @role == "admin"
      @assignments=Assignment.all
---
SELECT "assignments".* FROM "assignments" WHERE (store_id = 4)