app/views/shifts/index.html.erb

    <div class="dropdown-content">
      <% Store.all.each do |s| %>
---
SELECT "stores".* FROM "stores"

    <div class="dropdown-content">
      <% Employee.all.each do |s| %>
---
SELECT "employees".* FROM "employees"