app/views/shiftjobs/_form.html.erb

    if @role == "admin"
      @shifts = Shift.all
---
SELECT "shifts".* FROM "shifts"