app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments" WHERE (employee_id = 20) ORDER BY start_date DESC, end_date DESC
SELECT "employees".* FROM "employees" INNER JOIN "assignments" ON "assignments"."employee_id" = "employees"."id" WHERE "employees"."role" = ? AND (store_id = 4)  [["role", "employee"]]
SELECT "stores".* FROM "stores"
SELECT "assignments".* FROM "assignments" WHERE (employee_id = '23')
---
  def index
    @role = current_user_role
    if @role == "manager"
      @assignments = Assignment.for_store(current_user.employee.current_assignment.store_id).for_role("employee")
    end
    if @role == "employee"
      @assignments = Assignment.for_employee(current_user.employee)
    end
    if @role == "admin"
      @assignments = Assignment.all
    end
    @assignments = @assignments.current(params[:current]) if params[:current].present?
    @assignments = @assignments.past(params[:past]) if params[:past].present?
    @assignments = @assignments.by_store(params[:by_store]) if params[:by_store].present?
    @assignments = @assignments.by_employee(params[:by_employee]) if params[:by_employee].present?
    @assignments = @assignments.chronological(params[:chronological]) if params[:chronological].present?
    @assignments = @assignments.for_store(params[:for_store]) if params[:for_store].present?
    @assignments = @assignments.for_employee(params[:for_employee]) if params[:for_employee].present?
    @assignments = @assignments.for_pay_level(params[:for_pay_level]) if params[:for_pay_level].present?
    @assignments = @assignments.for_role(params[:for_role]) if params[:for_role].present?

INSERT INTO "assignments" ("store_id", "employee_id", "start_date", "pay_level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["store_id", 4], ["employee_id", 20], ["start_date", "2019-04-20"], ["pay_level", 3], ["created_at", "2019-04-25 21:47:05.530125"], ["updated_at", "2019-04-25 21:47:05.530125"]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save

UPDATE "assignments" SET "end_date" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["end_date", nil], ["updated_at", "2019-04-25 21:47:50.207727"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @assignment.update(assignment_params)

SELECT "shifts".* FROM "shifts" WHERE "shifts"."assignment_id" = ? AND (date < '2019-04-25')  [["assignment_id", 5]]
SELECT COUNT(*) FROM "shifts" WHERE "shifts"."assignment_id" = ? AND (date < '2019-04-25')  [["assignment_id", 10]]
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 34]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 10]]
UPDATE "assignments" SET "end_date" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["end_date", "2019-04-25"], ["updated_at", "2019-04-25 21:50:20.381657"], ["id", 5]]
SELECT "shifts".* FROM "shifts" WHERE "shifts"."assignment_id" = ? AND (date >= '2019-04-25')  [["assignment_id", 5]]
---
  def destroy
    if (@assignment.shifts.past.length==0)
      @assignment.destroy
      respond_to do |format|
        format.html { redirect_to assignments_url, notice: 'Assignment was successfully destroyed.' }
        format.json { head :no_content }
      end
    else
      #we terminate
      @assignment.end_date=Date.current
      @assignment.save
      @upcomingshifts=@assignment.shifts.upcoming
      @upcomingshifts.each do |s|
        s.destroy