app/controllers/assignments_controller.rb

INSERT INTO "assignments" ("store_id", "employee_id", "start_date", "pay_level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["store_id", 1], ["employee_id", 13], ["start_date", "2019-04-04"], ["pay_level", 1], ["created_at", "2019-04-17 20:28:46.321644"], ["updated_at", "2019-04-17 20:28:46.321644"]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save

UPDATE "assignments" SET "start_date" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["start_date", "2017-04-21"], ["updated_at", "2019-04-21 18:52:38.853222"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @assignment.update(assignment_params)

DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]
---
  def destroy
    @assignment.destroy