app/controllers/demos_controller.rb

    def create
        user = User.find_by(email: params[:demo][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@a.com"], ["LIMIT", 1]]