app/controllers/employees_controller.rb

  def index
    @role = current_user_role
    if @role == "manager" && current_user.employee.current_assignment
      @employees = Employee.for_store(current_user.employee.current_assignment.store_id)
    else
      @employees = Employee.all
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 21]]
SELECT "stores".* FROM "stores"
SELECT "employees".* FROM "employees" INNER JOIN "assignments" ON "assignments"."employee_id" = "employees"."id" WHERE (store_id = '1')

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "first_name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["first_name", "Admin"], ["updated_at", "2019-04-24 18:52:07.550229"], ["id", 19]]

  def destroy
    if (Shift.for_employee(@employee.id).count == 0)
      @employee.destroy
      if @employee.user.present?
        @employee.user.destroy
      end
      # their assignment (if it exists) should also be deleted
      Assignment.for_employee(@employee).each { |item|
        item.destroy
      }
      respond_to do |format|
        format.html { redirect_to employees_url, notice: 'Employee and user were successfully destroyed.' }
        format.json { head :no_content }
      end
    else
      #the employee should be made inactive
      @employee.active=false
      @employee.save
      #their current assignment terminated
      @assignment= @employee.current_assignment
      unless @assignment == nil
        @assignment.end_date = Date.current
        @assignment.save
---
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 21]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 22]]
SELECT  "employees".* FROM "employees" WHERE (employees) LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."employee_id" = ? LIMIT ?  [["employee_id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
SELECT "assignments".* FROM "assignments" WHERE (employee_id = 22)
UPDATE "employees" SET "active" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["active", 0], ["updated_at", "2019-04-21 18:33:44.199321"], ["id", 13]]
UPDATE "assignments" SET "end_date" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["end_date", "2019-04-21"], ["updated_at", "2019-04-21 18:33:44.378067"], ["id", 3]]