app/controllers/employees_controller.rb

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."employee_id" = ? LIMIT ?  [["employee_id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @employee.destroy
    if @employee.user.present?
      @employee.user.destroy