app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
---
  def index
    @role = current_user_role
    if @role == "manager" && current_user.employee.current_assignment
      @employees = Employee.regulars.for_store(current_user.employee.current_assignment.store_id)
    else
      @employees = Employee.all
    end
    @employees = @employees.active(params[:active]) if params[:active].present?
    @employees = @employees.inactive(params[:inactive]) if params[:inactive].present?
    @employees = @employees.younger_than_18(params[:younger_than_18]) if params[:younger_than_18].present?
    @employees = @employees.is_18_or_older(params[:is_18_or_older]) if params[:is_18_or_older].present?
    @employees = @employees.regulars(params[:regulars]) if params[:regulars].present?
    @employees = @employees.managers(params[:managers]) if params[:managers].present?
    @employees = @employees.admins(params[:admins]) if params[:admins].present?
    @employees = @employees.alphabetical(params[:alphabetical]) if params[:alphabetical].present?
    @employees = @employees.for_store(params[:for_store]) if params[:for_store].present?

INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save