app/controllers/flavors_controller.rb

SELECT "flavors".* FROM "flavors" ORDER BY name ASC
SELECT "flavors".* FROM "flavors" WHERE "flavors"."active" = ?  [["active", 1]]
---
  def index
    @flavors = Flavor.all
    @flavors = @flavors.active(params[:active]) if params[:active].present?

INSERT INTO "flavors" ("name", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "vanilla"], ["active", 1], ["created_at", "2019-04-21 17:13:13.163164"], ["updated_at", "2019-04-21 17:13:13.163164"]]
---
  def create
    @flavor = Flavor.new(flavor_params)

    respond_to do |format|
      if @flavor.save

UPDATE "flavors" SET "name" = ?, "active" = ?, "updated_at" = ? WHERE "flavors"."id" = ?  [["name", "vanilla cookies"], ["active", 1], ["updated_at", "2019-04-21 17:43:02.677610"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @flavor.update(flavor_params)

UPDATE "flavors" SET "active" = ?, "updated_at" = ? WHERE "flavors"."id" = ?  [["active", 0], ["updated_at", "2019-04-26 15:51:27.002668"], ["id", 1]]
---
  def destroy
    @flavor.active="false"
    @flavor.save

SELECT  "flavors".* FROM "flavors" WHERE "flavors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_flavor
      @flavor = Flavor.find(params[:id])