app/controllers/shiftjobs_controller.rb

  def index
    @role = current_user_role
    @shiftjobs = Shiftjob.all
    if @role == "manager"
      @tempshiftjobs = []
      @shiftjobs.each do |s|
        if s.shift.assignment.employee.role == "employee" && s.shift.assignment.store_id == current_user.employee.current_assignment.store_id
          @tempshiftjobs.append(s)
        end
      end
      @shiftjobs=@tempshiftjobs
    end
    if @role == "employee"
      @tempshiftjobs = []
      @shiftjobs.each do |s|
---
SELECT "shiftjobs".* FROM "shiftjobs"

  def create
    @shiftjob = Shiftjob.new(shiftjob_params)

    respond_to do |format|
      if @shiftjob.save
---
INSERT INTO "shiftjobs" ("shift_id", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["shift_id", 4], ["job_id", 1], ["created_at", "2019-04-26 15:40:09.912704"], ["updated_at", "2019-04-26 15:40:09.912704"]]

  def destroy
    @shiftjob.destroy
---
DELETE FROM "shiftjobs" WHERE "shiftjobs"."id" = ?  [["id", 9]]

    def set_shiftjob
      @shiftjob = Shiftjob.find(params[:id])
---
SELECT  "shiftjobs".* FROM "shiftjobs" WHERE "shiftjobs"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]