app/controllers/shifts_controller.rb

  def index
    @role = current_user_role
    if @role == "manager" && current_user.employee.current_assignment
      @shifts = Shift.for_store(current_user.employee.current_assignment.store_id)
      @shifts.each do |s|
        if s.assignment.employee.role != "employee"
          @shifts.delete(s)
---
DELETE FROM "shifts" WHERE "shifts"."id" IN (SELECT "shifts"."id" FROM "shifts" INNER JOIN "assignments" ON "assignments"."id" = "shifts"."assignment_id" WHERE (store_id = 4) AND "shifts"."id" = ?)  [["id", 20]]

  def create
    @shift = Shift.new(shift_params)

    respond_to do |format|
      if @shift.save
---
INSERT INTO "shifts" ("assignment_id", "date", "start_time", "end_time", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @shift.update(shift_params)
---
UPDATE "shifts" SET "notes" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["notes", "edited"], ["updated_at", "2019-04-26 12:55:29.287160"], ["id", 40]]

  def destroy
    # @shift.destroy
    # respond_to do |format|
    #   format.html { redirect_to shifts_url, notice: 'Shift was successfully destroyed.' }
    #   format.json { head :no_content }
    # end

    respond_to do |format|
      if @shift.destroy
---
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 40]]

    def set_shift
      @shift = Shift.find(params[:id])
---
SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]