app/controllers/shifts_controller.rb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 21]]
SELECT "employees".* FROM "employees"
SELECT "shifts".* FROM "shifts" WHERE (date >= '2019-04-25' and date <= '2019-04-26')
SELECT "stores".* FROM "stores"
---
  def index
    @role = current_user_role
    if @role == "manager" && current_user.employee.current_assignment
      @shifts = Shift.for_store(current_user.employee.current_assignment.store_id)
    end
    if @role == "employee" && current_user.employee.current_assignment
      @shifts = Shift.for_employee(current_user.employee)
    end
    if @role == "admin"
      @shifts = Shift.all

INSERT INTO "shifts" ("assignment_id", "date", "start_time", "end_time", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @shift = Shift.new(shift_params)

    respond_to do |format|
      if @shift.save

UPDATE "shifts" SET "end_time" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["end_time", "2000-01-01 22:46:00"], ["updated_at", "2019-04-24 22:37:03.834441"], ["id", 25]]
---
  def update
    respond_to do |format|
      if @shift.update(shift_params)

DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 24]]
---
  def destroy
    # @shift.destroy
    # respond_to do |format|
    #   format.html { redirect_to shifts_url, notice: 'Shift was successfully destroyed.' }
    #   format.json { head :no_content }
    # end

    respond_to do |format|
      if @shift.destroy

SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
---
    def set_shift
      @shift = Shift.find(params[:id])