app/controllers/shiftjobs_controller.rb

  def create
    @shiftjob = Shiftjob.new(shiftjob_params)

    respond_to do |format|
      if @shiftjob.save
---
INSERT INTO "shiftjobs" ("shift_id", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["shift_id", 19], ["job_id", 2], ["created_at", "2019-04-21 14:56:23.942436"], ["updated_at", "2019-04-21 14:56:23.942436"]]

  def destroy
    @shiftjob.destroy
---
DELETE FROM "shiftjobs" WHERE "shiftjobs"."id" = ?  [["id", 1]]

    def set_shiftjob
      @shiftjob = Shiftjob.find(params[:id])
---
SELECT  "shiftjobs".* FROM "shiftjobs" WHERE "shiftjobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]