app/controllers/stores_controller.rb

  def index
    if logged_in?
      @stores = Store.all
    else
      @stores = Store.active
    end
    @stores = @stores.active(params[:active]) if params[:active].present?
---
SELECT "stores".* FROM "stores" ORDER BY name
SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @store.update(store_params)
---
UPDATE "stores" SET "name" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["name", "CMU"], ["updated_at", "2019-04-02 18:06:35.189591"], ["id", 1]]

  def destroy
    @store.active="false"
    @store.save
---
UPDATE "stores" SET "active" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["active", 0], ["updated_at", "2019-04-24 20:48:26.936140"], ["id", 6]]