app/controllers/storeflavors_controller.rb

  def index
    @storeflavors = Storeflavor.all
---
SELECT "flavors".* FROM "flavors"
SELECT "storeflavors".* FROM "storeflavors"

  def create
    @storeflavor = Storeflavor.new(storeflavor_params)

    respond_to do |format|
      if @storeflavor.save
---
INSERT INTO "storeflavors" ("store_id", "flavor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["store_id", 1], ["flavor_id", 2], ["created_at", "2019-04-21 17:44:16.353392"], ["updated_at", "2019-04-21 17:44:16.353392"]]

  def update
    respond_to do |format|
      if @storeflavor.update(storeflavor_params)
---
UPDATE "storeflavors" SET "flavor_id" = ?, "updated_at" = ? WHERE "storeflavors"."id" = ?  [["flavor_id", 2], ["updated_at", "2019-04-21 17:46:08.254692"], ["id", 2]]

  def destroy
    @storeflavor.destroy
---
DELETE FROM "storeflavors" WHERE "storeflavors"."id" = ?  [["id", 2]]

    def set_storeflavor
      @storeflavor = Storeflavor.find(params[:id])
---
SELECT  "flavors".* FROM "flavors" WHERE "flavors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "storeflavors".* FROM "storeflavors" WHERE "storeflavors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]