app/models/assignment.rb

  def end_previous_assignment
    current_assignment = Employee.find(self.employee_id).current_assignment
    if current_assignment.nil?
      return true
    else
      current_assignment.update_attribute(:end_date, self.start_date.to_date)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "assignments" SET "end_date" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["end_date", "2019-04-09"], ["updated_at", "2019-04-17 20:34:37.526655"], ["id", 2]]

  def employee_is_active_in_system
    all_active_employees = Employee.active.all.map{|e| e.id}
---
SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]

  def store_is_active_in_system
    all_active_stores = Store.active.all.map{|s| s.id}
---
SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]