app/models/employee.rb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 13]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 21]]
---
  def current_assignment
    curr_assignment = self.assignments.select{|a| a.end_date.nil?}
    # alternative method for finding current assignment is to use scope 'current' in assignments:
    # curr_assignment = self.assignments.current    # will also return an array of current assignments
    return nil if curr_assignment.empty?