app/models/job.rb

    def not_worked?
        @result=true
        unless (Shiftjob.where("job_id = ?", id).count ==0)
---
SELECT COUNT(*) FROM "shiftjobs" WHERE (job_id = 6)