app/models/shift.rb

  scope :for_store,     ->(store_id) { joins(:assignment).where("store_id = ?", store_id) }
  scope :for_employee,  ->(employee_id) { joins(:assignment).where("employee_id = ?", employee_id) }
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def assignment_is_current
    if assignment_id != nil
      assignment = Assignment.find(self.assignment_id)
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]