app/models/shift.rb

  def assignment_is_current
    assignment = Assignment.find(self.assignment_id)
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]